I can't reproduce this issue with the specified version using this simple configuration:

```hcl
# test.tf
terraform {
  required_providers {
    exoscale = {
      source  = "exoscale/exoscale"
      version = "0.26.0"
    }
  }
}

locals {
  zone = "ch-gva-2"
}

data "exoscale_compute_template" "ubuntu" {
  zone = local.zone
  name = "Linux Ubuntu 20.04 LTS 64-bit"
}

resource "exoscale_instance_pool" "test" {
  zone             = local.zone
  name             = "test-tf"
  service_offering = "small"
  template_id      = data.exoscale_compute_template.ubuntu.id
  disk_size        = 10
  size             = 1
}
```

```console
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # exoscale_instance_pool.test will be created
  + resource "exoscale_instance_pool" "test" {
      + disk_size        = 10
      + id               = (known after apply)
      + instance_prefix  = "pool"
      + ipv6             = false
      + name             = "test-tf"
      + service_offering = "small"
      + size             = 1
      + state            = (known after apply)
      + template_id      = "a5ddefa9-7e98-40cb-94b3-e20348b878fa"
      + virtual_machines = (known after apply)
      + zone             = "ch-gva-2"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

exoscale_instance_pool.test: Creating...
exoscale_instance_pool.test: Still creating... [10s elapsed]
exoscale_instance_pool.test: Creation complete after 19s [id=f41a723d-b22f-4ce2-a009-228d49aa8507]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ terraform plan
exoscale_instance_pool.test: Refreshing state... [id=f41a723d-b22f-4ce2-a009-228d49aa8507]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are
needed.
```